#!/usr/bin/env python3
# -*- coding: utf-8 -*-
##################################################################

# set(集合),与dict类似，区别是只有键key没有值value
# 用set函数创建一个set，需要提供一个list作为输入集合
s = set([1, 2, 3, 4, 'str', 1.2341])
print(s)
# 由于键的唯一性，如果传入的list有重复的则会被丢弃
s = set([1, 1, 2, 2, 'a', 'a'])
print(s)  # 实际的s只有3个元素

###################################################################
# set可以看成数学意义上的无序和无重复元素的集合，
# 因此，两个set可以做数学意义上的交集、并集等操作：
###################################################################
s1 = set([1, 2, 5, 9, 'a', 'str1'])
s2 = set([2, 6, 3, 'b', 'a'])
s3 = s1 & s2  # 交集
s4 = s1 | s2  # 并集
print(s3)
print(s4)

input('\n按enter退出\n============================\n')
